---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexStream.Dispose
source: html/0b70a6fc-4e4d-8083-e396-7960a7542c61.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexStream.Dispose Method

Releases all resources used by the VertexStream

## Syntax (C#)
```csharp
public void Dispose()
```